## One Hot Encoding 

**There are 2 types of catogorical variables :- 1) Nominal ex.- Male,female; Pune ,Mumbai,Kolkata; green,red ,blue;  2)Ordinal ex.- high,medium,low; graduate ,masters ,phD;(they have some sort of numerical ordering in them)**

Therefore in case of Nominal categorical variables we use in One Hot Encoding

In [10]:
import pandas as pd
from sklearn import linear_model

In [11]:
df=pd.read_csv("/Users/sudhanshukumar/Documents/Machine Learning/csv files/Sample_Home_Prices.csv")
df

        town  area   price
0       Pune  2600  550000
1       Pune  3000  565000
2       Pune  3200  610000
3       Pune  3600  680000
4       Pune  4000  725000
5     Mumbai  2600  585000
6     Mumbai  2800  615000
7     Mumbai  3300  650000
8     Mumbai  3600  710000
9   Banglore  2600  575000
10  Banglore  2900  600000
11  Banglore  3100  620000
12  Banglore  3600  695000

In [7]:
dummies =pd.get_dummies(df.town)   #creates dummy variables
dummies

    Banglore  Mumbai  Pune
0          0       0     1
1          0       0     1
2          0       0     1
3          0       0     1
4          0       0     1
5          0       1     0
6          0       1     0
7          0       1     0
8          0       1     0
9          1       0     0
10         1       0     0
11         1       0     0
12         1       0     0

In [18]:
merged=pd.concat([df,dummies],axis="columns")  #merges dummy variables with the original
merged        #now we don't need original "town" column so we'll drop it

        town  area   price  Banglore  Mumbai  Pune
0       Pune  2600  550000         0       0     1
1       Pune  3000  565000         0       0     1
2       Pune  3200  610000         0       0     1
3       Pune  3600  680000         0       0     1
4       Pune  4000  725000         0       0     1
5     Mumbai  2600  585000         0       1     0
6     Mumbai  2800  615000         0       1     0
7     Mumbai  3300  650000         0       1     0
8     Mumbai  3600  710000         0       1     0
9   Banglore  2600  575000         1       0     0
10  Banglore  2900  600000         1       0     0
11  Banglore  3100  620000         1       0     0
12  Banglore  3600  695000         1       0     0

### Dummy variable trap:
**The Dummy variable trap is a scenario where there are attributes which are highly correlated (Multicollinear) and one variable predicts the value of others. Hence, one dummy variable is highly correlated with other dummy variables. Using all dummy variables for regression models lead to dummy variable trap.**

In [38]:
## final=merged.drop(["town","Pune"],axis=1) 
final  # its a good practice to drop manually

    area   price  Banglore  Mumbai
0   2600  550000         0       0
1   3000  565000         0       0
2   3200  610000         0       0
3   3600  680000         0       0
4   4000  725000         0       0
5   2600  585000         0       1
6   2800  615000         0       1
7   3300  650000         0       1
8   3600  710000         0       1
9   2600  575000         1       0
10  2900  600000         1       0
11  3100  620000         1       0
12  3600  695000         1       0

In [32]:
X=final.drop("price",axis=1)  #axis=1 refers to columns and 0 for rows
y=final.price

In [35]:
reg=linear_model.LinearRegression()

In [36]:
reg.fit(X,y)

LinearRegression()

In [40]:
reg.predict([[2800,1,0]])   # 1,0 means Bangalore

array([590775.63964739])

In [42]:
reg.predict([[3400,0,0]])   #0,0 means pune    #0,1 means Mumbai

array([641227.69296925])

In [43]:
reg.score(X,y)  #95% accurate

0.9573929037221872

In [44]:
# using inbuit encoder of sklearn

In [46]:
from sklearn.preprocessing import LabelEncoder

In [47]:
le= LabelEncoder()    #creating object

In [50]:
df.town=le.fit_transform(df.town)   #converting string(names) of town into numeric
df

    town  area   price
0      2  2600  550000
1      2  3000  565000
2      2  3200  610000
3      2  3600  680000
4      2  4000  725000
5      1  2600  585000
6      1  2800  615000
7      1  3300  650000
8      1  3600  710000
9      0  2600  575000
10     0  2900  600000
11     0  3100  620000
12     0  3600  695000

In [120]:
X= df[["town","area"]].values
y=df.price.values

In [121]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder()
from sklearn.compose import ColumnTransformer
ct=ColumnTransformer([('town',ohe,[0])],remainder="passthrough")

In [122]:
X=ct.fit_transform(X)
X

array([[0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.2e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 2.9e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.1e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.6e+03]])

In [123]:
reg.fit(X,y)

LinearRegression()

In [124]:
reg.predict([[0,0,1,2800]])

array([565089.22812299])

In [126]:
reg.score(X,y)

0.9573929037221874